# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок,
# если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?


sum = int(input("Введите общее количество журавликов: "))
x = sum / 3
petya_sereja = x / 2
katya = 2 * x

print(f"Петя и Сережа сделали по {petya_sereja} журавлика каждый.")
print(f"Катя сделала {katya} журавликов.")
